<template>
	<view>
		<text class="content">更新日期(2021-04-09)

			尊敬的用户，欢迎阅读dcloud服务协议（以下简称“本服务协议”）。 与用户共同确认： 
			
			1. 用户点击本服务协议正本下方的“确认”按钮并完成注册程序、获得账号和密码时，则视为用户与已达成本服务协议。本服务协议即在用户和之间产生法律效力。 
			
			2. 本服务协议内容包括协议正文及所有已经发布的或将来可能发布的各类规则。用户在使用提供的各项服务的同时，承诺接受并遵守相关的各类规则。 
			
			3. 有权根据需要不时地制定、修改本服务协议正文或各类规则，如本服务协议有任何变更，将在网站上刊载公告，予以公示。经修订的协议一经在网站公布后，立即自动生效。各类规则在网站发布后立即生效，亦成为本服务协议的一部分。若用户登录或继续使用提供服务的，将表示用户接受经修订的协议。若用户不同意相关变更，必须停止使用提供的服务。 
			
			4. 及用户均已认真阅读本服务协议中的全部条款（特别是以黑体字或下划线标示出的有关及用户重大权益的条款）及发布的其他各类规则的内容，对协议正文及各类规则均以知晓、理解并接受，同意将其作为确定双方权利、义务的依据。  
			
			条款如下：
			
			一、定义条款	接受并同意本服务协议全部条款及发布的其他各类规则，通过网站注册成为会员，且具备完全民事行为能力或者获经法定代理人同意的限制民事行为能力的自然人、法人、个体工商户或者其他组织。
			用户分为商家用户和普通用户。 1.1.1 商家用户 指通过注册成为的会员，并发布商家及其产品或者服务信息的法人、个体工商户或者其他组织，即为本服务协议文中“商家”。 1.1.2 普通用户 指享受服务的普通用户，即为本服务协议文中“房客”。  
			
			
			二、用户注册  2.1 注册资格 用户保证，其具有完全民事权利能力和行为能力或虽不具有完全民事权利能力和行为能力但经其法定代理人同意享用服务。否则，其与之间的服务协议自始无效，一经发现，有权立即注销该用户，并追究其使用提供服务的一切法律责任。 2.2 注册流程 2.2.1 用户同意根据用户注册页面要求提供有效电子邮箱、联系电话等信息，设置账号及密码，用户应确保所提供全部信息的真实性、完整性和准确性。 2.2.2 用户合法、完整并有效提供注册所需信息的，有权获得账号和密码，账号和密码用于用户在进行会员登录。同时用户应当对以其账号进行的所有活动和事件负法律责任。 2.2.3 用户获得账号及密码时视为用户注册成功，用户同意接收发送的与管理、运营相关的电子邮件和/或短消息。 2.3 税费承担 用户通过购销产品或服务而发生的全部应纳税赋，均由用户自行支付。 "
		</text>
	</view>
</template>

<script>
	export default {
		data() {
			return {

			}
		},
		methods: {

		}
	}
</script>

<style>
	.content {
		padding: 20rpx;
	}
</style>
